{
  "backend/main.mo": "Main actor defines platform data types, branding state, media/tutorial/product/user models, and initializes access control, token system, and storage-backed state maps.",
  "backend/token.mo": "Implements token system with balances, transaction histories, and operations for minting, transferring, spending, and retrieving token data.",
  "feature_evidence.json": "Feature evidence report mapping a branding-update feature to relevant frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Collection of prewritten summaries describing the purpose and behavior of various frontend React/TypeScript files.",
  "frontend/index.html": "Base HTML template setting the document title to 3Docarinas and loading the frontend entry script.",
  "frontend/src/App.tsx": "Configures TanStack Router routes, handles auth and profile setup flow, applies theme provider, and includes global components like AI chat and toasts.",
  "frontend/src/components/AddProductDialog.tsx": "Dialog for creating new products with image upload, validation, and progress tracking.",
  "frontend/src/components/AddTutorialDialog.tsx": "Dialog for adding tutorials, including video upload or selection, metadata input, and submission logic.",
  "frontend/src/components/admin/BrandingSection.tsx": "Admin section to edit site name, slogan, logo, and icon with file uploads and preview handling.",
  "frontend/src/components/admin/HeroSettingsSection.tsx": "Admin interface for editing hero headline, subheadline, and hero image with upload and preview logic.",
  "frontend/src/components/admin/PageSettingsSection.tsx": "Admin UI for editing per‑page titles, subtitles, and banner images with upload and reset support.",
  "frontend/src/components/AIAssistantPanel.tsx": "Component displaying AI assistant feedback and suggestions, polling backend responses based on video timestamp with enable/disable control.",
  "frontend/src/components/AIChatTutor.tsx": "Floating chat widget that handles user messages, auto-scrolling, and generates simple rule‑based AI responses for ocarina learning.",
  "frontend/src/components/CartDrawer.tsx": "Shopping cart drawer with quantity controls, token or Stripe checkout flows, and user authentication checks.",
  "frontend/src/components/DepositICPDialog.tsx": "Empty component file.",
  "frontend/src/components/EditProductDialog.tsx": "Dialog for editing product info and images with reorder, upload, and validation features.",
  "frontend/src/components/ExternalBlobImage.tsx": "Image component that loads ExternalBlob URLs with loading and error fallback states.",
  "frontend/src/components/Layout.tsx": "Main layout component handling navigation, branding, authentication, and dynamic favicon updates.",
  "frontend/src/components/LoadingScreen.tsx": "Displays a centered animated loading screen with a music icon and message.",
  "frontend/src/components/MediaLibraryManager.tsx": "Admin media manager for uploading, listing, and deleting video files with progress tracking and permission checks.",
  "frontend/src/components/MintTokensDialog.tsx": "Dialog for admins to mint tokens by specifying recipient, amount, and optional description.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for new users to create a profile with username and bio and submit it to the backend.",
  "frontend/src/components/RestoreProductsDialog.tsx": "Dialog that restores predefined product templates by uploading image assets and creating product entries.",
  "frontend/src/components/SendTokensDialog.tsx": "Dialog for sending tokens to another user with balance validation and optional description.",
  "frontend/src/components/ShareRecordingDialog.tsx": "Dialog for uploading an audio/video recording, creating a post, and showing upload progress.",
  "frontend/src/components/StripeConfigDialog.tsx": "Dialog for entering a Stripe secret key and allowed country codes and saving the configuration.",
  "frontend/src/components/WorkWithUsDialog.tsx": "Dialog for submitting a work‑with‑us application with name, email, and message.",
  "frontend/src/config/appBuildInfo.ts": "Provides helpers to read build metadata from environment variables and format or detect environment info.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, invalidating related queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth context with login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, access control, branding, media, and various app data via the actor.",
  "frontend/src/index.css": "Sets global Tailwind CSS layers and custom CSS variables for light and dark themes.",
  "frontend/src/lib/cartStore.ts": "Implements a Zustand store for managing cart items, quantities, and operations.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Renders the admin panel with permission checks and tabbed sections for managing content and settings.",
  "frontend/src/pages/CommunityPage.tsx": "Displays community posts with banner, actions, and dialogs for sharing recordings or applying to work.",
  "frontend/src/pages/HomePage.tsx": "Renders the home page with hero content, feature cards, and lists of featured tutorials and products using fetched settings and data.",
  "frontend/src/pages/LearningPage.tsx": "Displays a learning banner, difficulty filters, and a tutorials grid with data fetched from queries and optional authentication.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a failure message after an unsuccessful payment with navigation options back to the store or home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Clears the cart, refreshes queries, shows a success toast, and displays confirmation UI with navigation options after a successful payment.",
  "frontend/src/pages/ProfilePage.tsx": "Fetches and shows the logged-in user’s profile, token balance, uploaded items, and purchased items with navigation to wallet.",
  "frontend/src/pages/StorePage.tsx": "Displays the product store with cart integration, admin tools for editing and deleting products, and automatic cart opening for checkout flows.",
  "frontend/src/pages/WalletPage.tsx": "React wallet page showing token balance and transaction history with send-token dialog and identity checks.",
  "frontend/src/types.ts": "Shared TypeScript enums and interfaces for tutorials, posts, settings, chat, AI interactions, and token transactions.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, supporting hash and query routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, container settings, and enabling plugins.",
  "project_state.json": "Project state describing app rename to 3Docarinas and pending Stripe settings restoration feature requests."
}